#ifndef ADVSYS_DATA_H_INCLUDED
#define ADVSYS_DATA_H_INCLUDED
#include <genesis.h>
#include "../res/advsys_resource.h"


//*****************************************************************************
// Defeine
//*****************************************************************************

// Command Define
#define ADV_CMD_STR (0)
#define ADV_CMD_IPTWAIT (1)
#define ADV_CMD_IPTJMP (2)
#define ADV_CMD_IF (3)
#define ADV_CMD_IMG (4)
#define ADV_CMD_SETVAL (5)
#define ADV_CMD_ADDVAL (6)
#define ADV_CMD_SUBVAL (7)
#define ADV_CMD_JMP (8)
#define ADV_CMD_END (999)

// Operator Define
#define ADV_OPR_EQUAL (0)
#define ADV_OPR_MORE_THAN (1)
#define ADV_OPR_LESS_THAN (2)
#define ADV_OPR_E_MORE_THAN (3)
#define ADV_OPR_E_LESS_THAN (4)
#define ADV_OPR_N_EQUAL (5)

// Valiable Length Define
#define ADV_VAL_MAX (2)

//*****************************************************************************
// Adv Data Array
//*****************************************************************************

// Scene Command Index Data
static u16 adv_scene_idx_data[] = {
    0,
    5,
    9,
    13,
    15,
    19,
    21,
    23,
    27,
    31,
    37,
    39,
    43,
    49,
};

// String Data
static char *adv_str_data[] = {
    "俺はモブ山おじ太郎。",
    "目が覚めたら密室に閉じ込められていたので脱出を試みようと思う。",
    "どこを調べるか・・・",
    "↑：ドア　←：壁　↓：北を向く　→：壁の穴",
    "鍵がかかっていて出られない。",
    "鍵穴はなく、持っている鍵では開かないようだ。",
    "ドアノブを回すと扉が開いた。",
    "扉の外へ足をふみだした・・・",
    "　～～～イエーイクリアおめでとさん★★★",
    "普通にしっかりした壁で壊すことはできなさそうだ。",
    "とても人が通れる大きさの穴ではない。",
    "↑：絵　←：床　↓：南を向く　→：宝箱",
    "何の変哲もない絵だ。",
    "やはり絵をもっとよく調べることにした。",
    "なんと、絵の裏に鍵がテープで貼\り付けてあった！",
    "鍵を手に入れた！",
    "床をよく見たが特に変わったものはないようだ。",
    "宝箱には鍵がかかっている。",
    "鍵を使って宝箱を開けた。",
    "なんと、宝箱の中に怪しいスイッチが隠されていた！",
    "怪しいスイッチを押した！",
    "どこかで何かが開く音がした…。",
    "宝箱の中には押し込まれた怪しいスイッチがある。",
};

//  Valiable Data
static u16 adv_val_data[ADV_VAL_MAX];
// Image Data
static Image *adv_img_data[] = {
    &adv_img000,
    &adv_img001,
};

// Command Data
static ADV_CMD adv_cmd_data[] = {
    { 5 , 0 , 0 , 0 , 0 },
    { 5 , 1 , 0 , 0 , 0 },
    { 4 , 0 , 0 , 0 , 0 },
    { 0 , 0 , 0 , 0 , 0 },
    { 0 , 1 , 0 , 0 , 0 },
    { 4 , 0 , 0 , 0 , 0 },
    { 0 , 2 , 0 , 0 , 0 },
    { 1 , 3 , 0 , 0 , 0 },
    { 2 , 2 , 5 , 7 , 6 },
    { 3 , 0 , 0 , 1 , 3 },
    { 3 , 0 , 0 , 2 , 4 },
    { 0 , 4 , 0 , 0 , 0 },
    { 8 , 1 , 0 , 0 , 0 },
    { 0 , 5 , 0 , 0 , 0 },
    { 8 , 1 , 0 , 0 , 0 },
    { 0 , 6 , 0 , 0 , 0 },
    { 0 , 7 , 0 , 0 , 0 },
    { 0 , 8 , 0 , 0 , 0 },
    { 999 , 0 , 0 , 0 , 0 },
    { 0 , 9 , 0 , 0 , 0 },
    { 8 , 1 , 0 , 0 , 0 },
    { 0 , 10 , 0 , 0 , 0 },
    { 8 , 1 , 0 , 0 , 0 },
    { 4 , 1 , 0 , 0 , 0 },
    { 0 , 2 , 0 , 0 , 0 },
    { 1 , 11 , 0 , 0 , 0 },
    { 2 , 8 , 10 , 1 , 11 },
    { 3 , 1 , 0 , 2 , 9 },
    { 0 , 12 , 0 , 0 , 0 },
    { 6 , 1 , 1 , 0 , 0 },
    { 8 , 7 , 0 , 0 , 0 },
    { 0 , 13 , 0 , 0 , 0 },
    { 0 , 14 , 0 , 0 , 0 },
    { 0 , 15 , 0 , 0 , 0 },
    { 5 , 0 , 1 , 0 , 0 },
    { 6 , 1 , 1 , 0 , 0 },
    { 8 , 7 , 0 , 0 , 0 },
    { 0 , 16 , 0 , 0 , 0 },
    { 8 , 7 , 0 , 0 , 0 },
    { 3 , 0 , 0 , 1 , 12 },
    { 3 , 0 , 0 , 2 , 13 },
    { 0 , 17 , 0 , 0 , 0 },
    { 8 , 7 , 0 , 0 , 0 },
    { 0 , 18 , 0 , 0 , 0 },
    { 0 , 19 , 0 , 0 , 0 },
    { 0 , 20 , 0 , 0 , 0 },
    { 0 , 21 , 0 , 0 , 0 },
    { 5 , 0 , 2 , 0 , 0 },
    { 8 , 7 , 0 , 0 , 0 },
    { 0 , 22 , 0 , 0 , 0 },
    { 8 , 7 , 0 , 0 , 0 },
};

#endif // ADVSYS_DATA_H_INCLUDED
